DELETE FROM Privilege;


INSERT INTO
    Privilege (student_ID, type, description, expiration_date)
VALUES
    /* sql-formatter-disable */
    (2, 'Малозабезпечена сім’я', 'Учень із малозабезпеченої сім’ї. Отримує безкоштовне харчування в школі.', '2025-12-31'),
    (4, 'Сирота', 'Учень із статусом сироти. Має право на безкоштовне харчування та забезпечення навчальними матеріалами.', NULL),
    (6, 'Багатодітна сім’я', 'Учень із багатодітної сім’ї. Отримує знижку на додаткові освітні програми.', '2025-06-30'),
    (9, 'Інвалідність', 'Учень має інвалідність ІІІ групи. Пільги на транспорт та додаткове медичне забезпечення.', NULL);
    /* sql-formatter-enable */
