DELETE FROM Student;


INSERT INTO
    Student (
        firstname,
        middlename,
        lastname,
        gender,
        birthday,
        form_of_education,
        personal_file_number,
        note
    )
VALUES
    /* sql-formatter-disable */
    ('Олександр', 'Віталійович', 'Коваленко', 'M', '2011-05-14', 'Денна', '1001', 'Відмінник'),
    ('Марія', 'Олександрівна', 'Петренко', 'F', '2011-09-22', 'Денна', '1002', 'Активна в гуртках'),
    ('Дмитро', 'Ігорович', 'Сидоренко', 'M', '2011-03-10', 'Денна', '1003', 'Має високі досягнення у математиці'),
    ('Анна', 'Сергіївна', 'Бойко', 'F', '2011-12-05', 'Денна', '1004', 'Творча натура, любить малювати'),
    ('Максим', 'Михайлович', 'Шевченко', 'M', '2011-01-18', 'Денна', '1005', 'Сильний у спорті'),
    ('Олена', 'Василівна', 'Захаренко', 'F', '2011-07-30', 'Денна', '1006', 'Член шкільного самоврядування'),
    ('Іван', 'Андрійович', 'Кравчук', 'M', '2011-04-25', 'Денна', '1007', 'Захоплюється програмуванням'),
    ('Катерина', 'Богданівна', 'Лисенко', 'F', '2011-11-15', 'Денна', '1008', 'Переможниця районних олімпіад з біології'),
    ('Артем', 'Євгенович', 'Гончаренко', 'M', '2011-06-20', 'Денна', '1009', 'Має талант до музики'),
    ('Вікторія', 'Романівна', 'Савченко', 'F', '2011-08-12', 'Денна', '1010', 'Любить подорожі та географію');
    /* sql-formatter-enable */
