DELETE FROM Subject;


/* INSERT INTO */
/*     Subject (title, description, number_of_hours) */
/* VALUES */
/*     ( 'Математика', 'Наука, яка первісно виникла як один з напрямків пошуку істини у сфері просторових відношень і обчислень, для практичних потреб людини рахувати, обчислювати, вимірювати, досліджувати форми та рух фізичних тіл.', 68), */
/*     ( 'Українська Мова', 'Національна мова українців.', 85), */
/*     ( 'Інформатика', 'Наука про інформацію, методи та засоби її опрацювання, у тому числі за допомогою обчислювальних систем.', 34), */
/*     ( 'Фізика', 'Природнича наука, яка досліджує загальні властивості матерії та явищ у ній, а також виявляє загальні закони, які керують цими явищами.', 51), */
/*     ( 'Образотворче Мистецтво', 'Мистецтво відображення сущого у вигляді різних образів, зокрема таких як художні образи на площині та в просторі.', 17); */
INSERT INTO
    Subject (title, description, number_of_hours)
VALUES
    /* sql-formatter-disable */
    ('Українська мова', 'Вивчення граматики, лексики, правопису', 90),
    ('Література', 'Вивчення художніх творів, аналіз літературних жанрів', 70),
    ('Математика', 'Алгебра, геометрія, основи логіки', 120),
    ('Фізика', 'Основи механіки, електрики, теплових явищ', 60),
    ('Хімія', 'Вивчення хімічних елементів, реакцій, лабораторних робіт', 50),
    ('Біологія', 'Основи анатомії, ботаніки, зоології', 60),
    ('Історія України', 'Дослідження історичних подій та постатей України', 50),
    ('Всесвітня історія', 'Загальна історія світу, основні події', 50),
    ('Географія', 'Фізична, соціальна та економічна географія', 60),
    ('Іноземна мова (англійська)', 'Граматика, аудіювання, розмовна практика', 80),
    ('Інформатика', 'Основи програмування, робота з ПК, технології', 40),
    ('Музика', 'Музичні теорії, співи, аналіз творів', 30),
    ('Образотворче мистецтво', 'Техніки малювання, живопису, композиції', 30),
    ('Фізична культура', 'Розвиток фізичних навичок, командні ігри', 90),
    ('Основи здоров’я', 'Здоровий спосіб життя, безпека', 30);
    /* sql-formatter-enable */
