INSERT INTO
    Attendance (attendance, reason, student_ID, lesson_ID)
VALUES
    ('Присутній', NULL, 1, 1),
    ('Присутній', NULL, 1, 2),
    ('Присутній', NULL, 1, 3),
    ('Присутній', NULL, 1, 4),
    ('Присутній', NULL, 1, 5),
    ('Присутній', NULL, 2, 1),
    ('Присутній', NULL, 2, 2),
    ('Присутній', NULL, 2, 3),
    ('Присутній', NULL, 2, 4),
    ('Присутній', NULL, 2, 5),
    ('Присутній', NULL, 3, 1),
    ('Присутній', NULL, 3, 2),
    ('Присутній', NULL, 3, 3),
    ('Присутній', NULL, 3, 4),
    ('Присутній', NULL, 3, 5);
