DELETE FROM Subject;


INSERT INTO
    Subject (title, description, number_of_hours)
VALUES
    (
        'Математика',
        'Наука, яка первісно виникла як один з напрямків пошуку істини у сфері просторових відношень і обчислень, для практичних потреб людини рахувати, обчислювати, вимірювати, досліджувати форми та рух фізичних тіл.',
        68
    ),
    (
        'Українська Мова',
        'Національна мова українців.',
        85
    ),
    (
        'Інформатика',
        'Наука про інформацію, методи та засоби її опрацювання, у тому числі за допомогою обчислювальних систем.',
        34
    ),
    (
        'Фізика',
        'Природнича наука, яка досліджує загальні властивості матерії та явищ у ній, а також виявляє загальні закони, які керують цими явищами.',
        51
    ),
    (
        'Образотворче Мистецтво',
        'Мистецтво відображення сущого у вигляді різних образів, зокрема таких як художні образи на площині та в просторі.',
        17
    );
