DELETE FROM FamilyConnection;


INSERT INTO
    FamilyConnection (kinship, caretaker_ID, student_ID)
VALUES
    ('Батько', 1, 1),
    ('Мати', 2, 1),
    ('Батько', 3, 2),
    ('Мати', 4, 2),
    ('Батько', 5, 3),
    ('Мати', 6, 3),
    ('Батько', 7, 4),
    ('Мати', 8, 4),
    ('Батько', 9, 5),
    ('Мати', 10, 5),
    ('Дідусь', 11, 6),
    ('Бабуся', 12, 6),
    ('Батько', 13, 7),
    ('Мати', 14, 7),
    ('Батько', 15, 8),
    ('Мати', 16, 8),
    ('Батько', 17, 9),
    ('Мати', 18, 9),
    ('Батько', 19, 10),
    ('Мати', 20, 10);
