DELETE FROM Foodstuff;


DROP TABLE IF EXISTS Foodstuff;


CREATE TABLE Foodstuff (
    foodstuff_ID INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    price DECIMAL(10, 2) NOT NULL,
    type ENUM('Овочі', 'Фрукти', 'Цукерки', 'Печиво') NOT NULL
);


INSERT INTO
    Foodstuff (name, price, type)
VALUES
    /* sql-formatter-disable */
    ('Апельсини', 94.57, 'Фрукти'),
    ('Банани', 62.75, 'Фрукти'),
    ('Виноград', 146.28, 'Фрукти'),
    ('Лимони', 73.12, 'Фрукти'),
    ('Мандарини', 89.62, 'Фрукти'),
    ('Яблука українські', 32.74, 'Фрукти'),
    ('Груші імпортні', 90.00, 'Фрукти'),
    ('Ківі', 92.50, 'Фрукти'),
    ('Гранат', 100.00, 'Фрукти'),
    ('Хурма', 82.50, 'Фрукти'),
    
    ('Картопля', 30.57, 'Овочі'),
    ('Морква', 23.96, 'Овочі'),
    ('Капуста білокачанна', 31.95, 'Овочі'),
    ('Цибуля ріпчаста', 17.94, 'Овочі'),
    ('Буряк', 16.95, 'Овочі'),
    ('Помідори', 100.00, 'Овочі'),
    ('Огірки', 130.00, 'Овочі'),
    ('Перець болгарський', 90.00, 'Овочі'),
    ('Кабачки', 70.00, 'Овочі'),
    ('Баклажани', 80.00, 'Овочі'),
    
    ('Цукерки Рошен Yummi Gummi Banana Land', 341.43, 'Цукерки'),
    ('Цукерки Рошен Yummi Gummi Паста', 341.43, 'Цукерки'),
    ('Цукерки Рошен Yummi Mini Bear Mix желейні', 341.43, 'Цукерки'),
    ('Цукерки Рошен Yummi Gummi Sour Belts желейні', 341.43, 'Цукерки'),
    ('Цукерки Рошен Червоний Мак', 264.90, 'Цукерки'), 
    ('Цукерки Жако Пташка-Мармелашка глазуровані зі смаком вишні та апельсину', 188.49, 'Цукерки'),
    ('Цукерки Жако Пташине молоко зі смаком какао та зі смаком лимону', 188.49, 'Цукерки'),
    ('Цукерки Своя Лінія Crackly Crush з арахісом, нугою та карамеллю та ірисні з арахісом', 151.99, 'Цукерки'),
    ('Цукерки Рошен Київ Вечірній', 1423.30, 'Цукерки'),
    ('Цукерки Рошен Roshen Chocolateria шоколадні та пралінові', 1293.30, 'Цукерки'),
    
    ('Печиво Bahlsen «Хіт» горіх', 358.14, 'Печиво'),
    ('Печиво «Премія»® Савоярді', 339.95, 'Печиво'),
    ('Печиво «Премія»® «Савоярді» з какао', 339.95, 'Печиво'),
    ('Печиво вафельки', 526.20, 'Печиво'),
    ('Пряники «Повна Чаша»® молочні глазуровані', 139.97, 'Печиво'),
    ('Пряники «Повна Чаша»® з яблучною начинкою глазуровані', 136.79, 'Печиво'),
    ('Печиво Yarych «Марія» з молоком та кальцієм', 109.61, 'Печиво'),
    ('Печиво Roshen «До кави» пряжене молоко', 107.51, 'Печиво'),
    ('Печиво Oreo Original з какао та начинкою з ванільним смаком', 413.05, 'Печиво'),
    ('Печиво «Богуславна» вівсяне класичне', 149.98, 'Печиво');
    /* sql-formatter-enable */
