DELETE FROM Foodstuff;


DROP TABLE IF EXISTS Foodstuff;


CREATE TABLE Foodstuff (
    foodstuff_ID INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    frequency INT DEFAULT 0,
    name VARCHAR(255) NOT NULL,
    price DECIMAL(10, 2) NOT NULL,
    type ENUM('Овочі', 'Фрукти', 'Цукерки', 'Печиво') NOT NULL
);


INSERT INTO
    Foodstuff (name, price, type)
VALUES
    /* sql-formatter-disable */
    ('Апельсини', 94.57, 'Фрукти'),
    ('Банани', 62.75, 'Фрукти'),
    ('Виноград', 146.28, 'Фрукти'),
    ('Лимони', 73.12, 'Фрукти'),
    ('Мандарини', 89.62, 'Фрукти'),
    
    ('Картопля', 30.57, 'Овочі'),
    ('Помідори', 100.00, 'Овочі'),
    ('Огірки', 130.00, 'Овочі'),
    ('Морква', 23.96, 'Овочі'),
    ('Капуста', 31.95, 'Овочі'),
    
    ('Червоний Мак', 264.90, 'Цукерки'), 
    ('Пташка-Мармелашка', 188.49, 'Цукерки'),
    ('Пташине молоко', 188.49, 'Цукерки'),
    ('Crackly Crush', 151.99, 'Цукерки'),
    ('Шоколапки', 229.0, 'Цукерки'),
    
    ('Вушка', 110.50, 'Печиво'),
    ('День і ніч', 152.20, 'Печиво'),
    ('Вафлі', 167.00, 'Печиво'),
    ('До кави', 107.51, 'Печиво'),
    ('Вівсяне', 172.64, 'Печиво');
    /* sql-formatter-enable */
