// Написати метод, вхідними параметрами якого є рядок, символ. Метод повинен повернути номер позиції заданого символу в рядку, якщо він там є, і 0, якщо його там немає.
// Задача. Написати метод, який нічого не повертає, отримує на вхід масив цілих чисел та видаляє з нього парні значення.
// Задача. Написати метод, який нічого не повертає, отримує на вхід масив цілих чисел та видаляє з нього парні значення.

namespace pz2;

class Program
{

    static void Task1()
    {   
        // Заданий масив. Створити новий масив, в якому залишити лише унікальні елементи першого,
        // наприклад, [1,3,2,4,3,2,1] => [1,3,2,4]. 
        int[] arr = new int[] {1, 3, 2, 4, 3, 2, 1};
        int[] hashed = new int[arr.Length];
        int len = 0;
        
        foreach (int element in arr)
        {
            if (hashed.Contains(element)) continue;

            hashed[len] = element;
            len++;
        }
        
        Console.WriteLine(string.Join(", ", hashed[..len]));
    }

    static void Task2()
    {
        // Змініть програму так, щоб при вході в неї у користувача питалося,
        // суму чого порахувати (стовпчика або рядка), питався номер,
        // і порахувати суму елементів відповідного стовпця або відповідного рядка.
        Console.WriteLine("1 - row\n2 - column");
        int question = Console.Read();

    }
    
    static void Main(string[] args)
    {
    }
}